import React, { FC } from "react";
import { BsInfoCircle } from "react-icons/bs";

import Panel from "./Panel";

const DescriptionPanel: FC = () => {
  return (
    <Panel
      initiallyDeployed
      title={
        <>
          <BsInfoCircle className="text-muted" /> راهنما
        </>
      }
    >
      <p dir='rtl'>
        علم شبکه (انگلیسی: Network science) یک زمینه ی دانشگاهی است که شبکه‌های پیچیده از قبیل شبکه‌های ارتباط تلفنی، شبکه‌های رایانه‌ای، شبکه‌های زیستی، شبکه‌های معنایی و شناختی و شبکه‌های اجتماعی 
		را با در نظر داشتن تعداد عناصر مجزا و عوامل نمایش داده شده توسط گره‌ها (یا راس‌ها) و ارتباط بین عناصر یا عوامل به شکل پیوندها (لینک‌ها)، بررسی می‌کند. در این زمینه آکادمیک تئوری‌ها و روش‌هایی 
		مانند نظریه گراف از
		ریاضیات، مکانیک آماری از فیزیک، داده کاوی و تصویر سازی اطلاعات از علوم کامپیوتر، استنباط آماری از آمار، و ساختار اجتماعی از جامعه‌شناسی مورد استفاده قرار می‌گیرد
        .
      </p>
      <p dir='rtl'>
        اغلب شبکه‌ها ویژگی‌های خاصی دارند که می‌تواند برای تجزیه و تحلیل خواص و ویژگی‌های شبکه محاسبه شود. این ویژگی‌های شبکه اغلب
		مدل‌های مختلف شبکه را توصیف می‌کند و می‌تواند برای تجزیه و تحلیل شبکه‌ها و مقایسهٔ آن‌ها با یکدیگر استفاده شود.
      </p>
      <p dir='rtl'>
        تحلیل شبکه‌های اجتماعی (به انگلیسی: Social network analysis)، ساختار روابط بین نهادهای اجتماعی را بررسی می‌کند. این نهادها اغلب افراد هستند، اما ممکن است گروه‌ها،
		سازمان‌ها، ایالتهای‌ملی، وب‌سایت‌ها، نشریات علمی نیز باشند.
      </p>
    </Panel>
  );
};

export default DescriptionPanel;
